Repository: littlebobert/sasu-internal
Catalog: AppBundle/Localization/Localizable.xcstrings
Source language: en
Languages: ja, zh_hans, zh_hant

source: About Sasu
ja: Sasuについて
zh_hans: 关于 Sasu
zh_hant: 關於 Sasu

source: Accept Screen Recording
ja: 画面収録を許可
zh_hans: 允许屏幕录制
zh_hant: 允許螢幕錄製

source: Access
ja: アクセス
zh_hans: 访问方式
zh_hant: 存取方式

source: Accessibility permission granted
ja: アクセシビリティの許可済み
zh_hans: 已授予辅助功能权限
zh_hant: 已授予輔助使用權限

source: Accessibility permission required
ja: アクセシビリティの許可が必要です
zh_hans: 需要辅助功能权限
zh_hant: 需要輔助使用權限

source: After changing Screen Recording permission, macOS usually requires quitting and reopening Sasu before capture works.
ja: 画面収録の許可を変更した後は、通常、Sasuを終了して再度開くまでキャプチャを使用できません。
zh_hans: 更改屏幕录制权限后，通常需要退出并重新打开 Sasu，捕捉功能才能正常使用。
zh_hant: 更改螢幕錄製權限後，通常需要結束並重新開啟 Sasu，擷取功能才能正常使用。

source: After enabling Accessibility for Sasu, macOS usually requires quitting and reopening Sasu before Translate & Replace works.
ja: Sasuのアクセシビリティを有効にした後は、通常、Sasuを終了して再度開くまで「翻訳して置換」を使用できません。
zh_hans: 为 Sasu 启用辅助功能后，通常需要退出并重新打开 Sasu，“翻译并替换”才能正常使用。
zh_hant: 為 Sasu 啟用輔助使用後，通常需要結束並重新開啟 Sasu，「翻譯並取代」才能正常使用。

source: AI Model
ja: AIモデル
zh_hans: AI 模型
zh_hant: AI 模型

source: Answer copied to clipboard.
ja: 回答をクリップボードにコピーしました。
zh_hans: 回答已复制到剪贴板。
zh_hant: 回答已複製到剪貼簿。

source: Answer ready.
ja: 回答の準備ができました。
zh_hans: 回答已就绪。
zh_hant: 回答已就緒。

source: Answering…
ja: 回答中…
zh_hans: 正在回答…
zh_hant: 正在回答…

source: API key saved in Keychain
ja: APIキーはキーチェーンに保存されています
zh_hans: API 密钥已存储在钥匙串中
zh_hant: API 金鑰已儲存在鑰匙圈中

source: Appearance
ja: 外観
zh_hans: 外观
zh_hant: 外觀

source: Ask about this screenshot...
ja: このスクリーンショットについて質問...
zh_hans: 询问有关此截屏的问题...
zh_hant: 詢問有關此截圖的問題...

source: Asking OpenAI…
ja: OpenAIに問い合わせ中…
zh_hans: 正在询问 OpenAI…
zh_hant: 正在詢問 OpenAI…

source: Auto-hides after 5 seconds.
ja: 5秒後に自動的に非表示になります。
zh_hans: 5 秒后自动隐藏。
zh_hant: 5 秒後自動隱藏。

source: Automatically include full Safari page content
ja: Safariページ全体の内容を自動的に含める
zh_hans: 自动包含完整的 Safari 页面内容
zh_hant: 自動包含完整的 Safari 頁面內容

source: Best (GPT-5.6 High Fast)
ja: 最高（GPT-5.6 High Fast）
zh_hans: 最佳（GPT-5.6 High Fast）
zh_hant: 最佳（GPT-5.6 High Fast）

source: Better (GPT-5.6 Medium Fast)
ja: 高品質（GPT-5.6 Medium Fast）
zh_hans: 更佳（GPT-5.6 Medium Fast）
zh_hant: 更佳（GPT-5.6 Medium Fast）

source: Capture
ja: キャプチャ
zh_hans: 捕捉
zh_hant: 擷取

source: Capture & Ask
ja: キャプチャして質問
zh_hans: 捕捉并提问
zh_hant: 擷取並提問

source: Capture a screenshot first...
ja: 先にスクリーンショットを撮影してください...
zh_hans: 请先捕捉截屏...
zh_hant: 請先擷取截圖...

source: Capture Screen
ja: 画面をキャプチャ
zh_hans: 捕捉屏幕
zh_hant: 擷取螢幕

source: Capture stopped.
ja: キャプチャを停止しました。
zh_hans: 捕捉已停止。
zh_hant: 擷取已停止。

source: Capturing screen...
ja: 画面をキャプチャ中...
zh_hans: 正在捕捉屏幕...
zh_hant: 正在擷取螢幕...

source: Check for Updates…
ja: アップデートを確認…
zh_hans: 检查更新…
zh_hant: 檢查更新…

source: Choose at least one modifier for the Capture & Ask hotkey.
ja: 「キャプチャして質問」のホットキーには修飾キーを1つ以上選択してください。
zh_hans: 请为“捕捉并提问”快捷键至少选择一个修饰键。
zh_hant: 請為「擷取並提問」快速鍵至少選擇一個變更鍵。

source: Choose at least one modifier for the global hotkey.
ja: グローバルホットキーには修飾キーを1つ以上選択してください。
zh_hans: 请为全局快捷键至少选择一个修饰键。
zh_hant: 請為全域快速鍵至少選擇一個變更鍵。

source: Choose at least one modifier for the Translate & Replace hotkey.
ja: 「翻訳して置換」のホットキーには修飾キーを1つ以上選択してください。
zh_hans: 请为“翻译并替换”快捷键至少选择一个修饰键。
zh_hant: 請為「翻譯並取代」快速鍵至少選擇一個變更鍵。

source: Choose at least one modifier for the Translate Selection hotkey.
ja: 「選択範囲を翻訳」のホットキーには修飾キーを1つ以上選択してください。
zh_hans: 请为“翻译所选内容”快捷键至少选择一个修饰键。
zh_hant: 請為「翻譯所選內容」快速鍵至少選擇一個變更鍵。

source: Choose the language you translate from
ja: 翻訳元の言語を選択
zh_hans: 选择翻译源语言
zh_hant: 選擇翻譯來源語言

source: Clear
ja: 消去
zh_hans: 清除
zh_hant: 清除

source: Clear Invite Access
ja: 招待アクセスを消去
zh_hans: 清除邀请访问权限
zh_hant: 清除邀請存取權

source: Clear Key
ja: キーを消去
zh_hans: 清除密钥
zh_hant: 清除金鑰

source: Click `Sasuを始める` to start using Sasu.
ja: 「Sasuを始める」をクリックしてSasuの使用を開始します。
zh_hans: 点击“Sasuを始める”即可开始使用 Sasu。
zh_hant: 按一下「Sasuを始める」即可開始使用 Sasu。

source: Click Sasuを始める in the example to enable Screen Recording first.
ja: まず例の「Sasuを始める」をクリックして画面収録を有効にしてください。
zh_hans: 请先点击示例中的“Sasuを始める”以启用屏幕录制。
zh_hant: 請先按一下範例中的「Sasuを始める」以啟用螢幕錄製。

source: Click this green button to get started.
ja: この緑色のボタンをクリックして始めます。
zh_hans: 点击此绿色按钮即可开始。
zh_hant: 按一下這個綠色按鈕即可開始。

source: Copy Answer
ja: 回答をコピー
zh_hans: 复制回答
zh_hant: 複製回答

source: Copy Link
ja: リンクをコピー
zh_hans: 复制链接
zh_hant: 複製連結

source: Could not create report: %@
ja: レポートを作成できませんでした：%@
zh_hans: 无法创建报告：%@
zh_hant: 無法建立報告：%@

source: Could not open Mail. The report file was shown in Finder.
ja: メールを開けませんでした。レポートファイルをFinderに表示しました。
zh_hans: 无法打开“邮件”。报告文件已显示在“访达”中。
zh_hant: 無法開啟「郵件」。報告檔案已顯示於 Finder。

source: Could not open screenshot preview.
ja: スクリーンショットのプレビューを開けませんでした。
zh_hans: 无法打开截屏预览。
zh_hant: 無法開啟截圖預覽。

source: Current page
ja: 現在のページ
zh_hans: 当前页面
zh_hant: 目前頁面

source: Current: %@
ja: 現在：%@
zh_hans: 当前：%@
zh_hant: 目前：%@

source: Decrease Text Size
ja: 文字を小さく
zh_hans: 减小文本大小
zh_hant: 縮小文字

source: Do Not Include
ja: 含めない
zh_hans: 不包含
zh_hant: 不包含

source: Don’t Ask Again
ja: 今後確認しない
zh_hans: 不再询问
zh_hant: 不再詢問

source: Double-click to open screenshot
ja: ダブルクリックしてスクリーンショットを開く
zh_hans: 双击打开截屏
zh_hant: 按兩下以開啟截圖

source: Enable for Safari
ja: Safariで有効にする
zh_hans: 为 Safari 启用
zh_hant: 為 Safari 啟用

source: Enable Translate & Replace?
ja: 「翻訳して置換」を有効にしますか？
zh_hans: 启用“翻译并替换”？
zh_hant: 啟用「翻譯並取代」？

source: English
ja: 英語
zh_hans: 英语
zh_hant: 英文

source: Error
ja: エラー
zh_hans: 错误
zh_hant: 錯誤

source: Follow-up
ja: 追加の質問
zh_hans: 后续问题
zh_hant: 後續問題

source: Full Safari page included
ja: Safariページ全体を含めました
zh_hans: 已包含完整的 Safari 页面
zh_hant: 已包含完整的 Safari 頁面

source: General
ja: 一般
zh_hans: 通用
zh_hant: 一般

source: Have questions? Contact me (the developer).
ja: ご質問は開発者までお問い合わせください。
zh_hans: 有疑问？请联系我（开发者）。
zh_hant: 有疑問？請聯絡我（開發者）。

source: Have questions about privacy?
ja: プライバシーについてご質問がありますか？
zh_hans: 对隐私有疑问？
zh_hant: 對隱私有疑問？

source: Hide
ja: 隠す
zh_hans: 隐藏
zh_hant: 隱藏

source: Hide guidance
ja: 案内を隠す
zh_hans: 隐藏指引
zh_hant: 隱藏指引

source: Hotkeys
ja: ホットキー
zh_hans: 快捷键
zh_hant: 快速鍵

source: Include
ja: 含める
zh_hans: 包含
zh_hant: 包含

source: Include Full Safari Page?
ja: Safariページ全体を含めますか？
zh_hans: 包含完整的 Safari 页面？
zh_hant: 包含完整的 Safari 頁面？

source: Increase Text Size
ja: 文字を大きく
zh_hans: 增大文本大小
zh_hant: 放大文字

source: Invite access
ja: 招待アクセス
zh_hans: 邀请访问
zh_hant: 邀請存取

source: Invite access saved in Keychain
ja: 招待アクセスはキーチェーンに保存されています
zh_hans: 邀请访问权限已存储在钥匙串中
zh_hant: 邀請存取權已儲存在鑰匙圈中

source: Japanese
ja: 日本語
zh_hans: 日语
zh_hant: 日文

source: Key
ja: キー
zh_hans: 按键
zh_hant: 按鍵

source: Key %lld
ja: キー %lld
zh_hans: 按键 %lld
zh_hant: 按鍵 %lld

source: Made in Japan
ja: 日本製
zh_hans: 日本制造
zh_hant: 日本製造

source: My OpenAI API key
ja: 自分のOpenAI APIキー
zh_hans: 我的 OpenAI API 密钥
zh_hant: 我的 OpenAI API 金鑰

source: No API key saved
ja: APIキーは保存されていません
zh_hans: 未存储 API 密钥
zh_hant: 未儲存 API 金鑰

source: No invite access saved
ja: 招待アクセスは保存されていません
zh_hans: 未存储邀请访问权限
zh_hant: 未儲存邀請存取權

source: Not Now
ja: 今はしない
zh_hans: 暂不
zh_hant: 稍後

source: Not Yet
ja: 後で
zh_hans: 暂不
zh_hant: 稍後

source: On-screen guidance for macOS
ja: macOSの画面上で操作を案内
zh_hans: macOS 屏幕操作指引
zh_hant: macOS 螢幕操作指引

source: On your command, Sasu will capture your screen, then wait for your question before sending anything.
ja: 指示するとSasuが画面をキャプチャし、質問を入力するまで何も送信せずに待機します。
zh_hans: 收到您的指令后，Sasu 会捕捉屏幕，并在发送任何内容之前等待您输入问题。
zh_hant: 收到您的指令後，Sasu 會擷取螢幕，並在傳送任何內容之前等待您輸入問題。

source: Open Accessibility Settings
ja: アクセシビリティ設定を開く
zh_hans: 打开辅助功能设置
zh_hant: 開啟輔助使用設定

source: Open Automation Settings
ja: オートメーション設定を開く
zh_hans: 打开自动化设置
zh_hant: 開啟自動化設定

source: Open Screen Recording Settings
ja: 画面収録設定を開く
zh_hans: 打开屏幕录制设置
zh_hant: 開啟螢幕錄製設定

source: Proceed
ja: 続ける
zh_hans: 继续
zh_hant: 繼續

source: Question
ja: 質問
zh_hans: 问题
zh_hant: 問題

source: Redeem Invite
ja: 招待コードを引き換える
zh_hans: 兑换邀请
zh_hant: 兌換邀請

source: Relaunch Sasu
ja: Sasuを再起動
zh_hans: 重新启动 Sasu
zh_hant: 重新啟動 Sasu

source: Report a Bug
ja: バグを報告
zh_hans: 报告错误
zh_hant: 回報錯誤

source: Request Accessibility Access
ja: アクセシビリティへのアクセスを要求
zh_hans: 请求辅助功能权限
zh_hant: 要求輔助使用權限

source: Request stopped.
ja: リクエストを停止しました。
zh_hans: 请求已停止。
zh_hant: 要求已停止。

source: Reset Capture & Ask Hotkey
ja: 「キャプチャして質問」のホットキーをリセット
zh_hans: 重置“捕捉并提问”快捷键
zh_hant: 重設「擷取並提問」快速鍵

source: Reset Command Wheel Hotkey
ja: コマンドホイールのホットキーをリセット
zh_hans: 重置命令轮盘快捷键
zh_hant: 重設指令轉盤快速鍵

source: Reset Translate & Replace Hotkey
ja: 「翻訳して置換」のホットキーをリセット
zh_hans: 重置“翻译并替换”快捷键
zh_hant: 重設「翻譯並取代」快速鍵

source: Reset Translate Selection Hotkey
ja: 「選択範囲を翻訳」のホットキーをリセット
zh_hans: 重置“翻译所选内容”快捷键
zh_hant: 重設「翻譯所選內容」快速鍵

source: Safari Enhancement
ja: Safari拡張機能
zh_hans: Safari 增强功能
zh_hant: Safari 增強功能

source: Safari page not included
ja: Safariページは含まれていません
zh_hans: 未包含 Safari 页面
zh_hant: 未包含 Safari 頁面

source: Save Key
ja: キーを保存
zh_hans: 存储密钥
zh_hant: 儲存金鑰

source: Screenshot
ja: スクリーンショット
zh_hans: 截屏
zh_hant: 截圖

source: Screenshot Preview
ja: スクリーンショットのプレビュー
zh_hans: 截屏预览
zh_hant: 截圖預覽

source: Screen Recording
ja: 画面収録
zh_hans: 屏幕录制
zh_hant: 螢幕錄製

source: Send
ja: 送信
zh_hans: 发送
zh_hant: 傳送

source: Settings
ja: 設定
zh_hans: 设置
zh_hant: 設定

source: Settings…
ja: 設定…
zh_hans: 设置…
zh_hant: 設定…

source: Show
ja: 表示
zh_hans: 显示
zh_hant: 顯示

source: Show me where to click
ja: クリックする場所を表示
zh_hans: 显示点击位置
zh_hant: 顯示點按位置

source: Show Transcript
ja: 会話記録を表示
zh_hans: 显示对话记录
zh_hant: 顯示對話記錄

source: Simplified Chinese
ja: 簡体字中国語
zh_hans: 简体中文
zh_hant: 簡體中文

source: Sasu Command Wheel
ja: Sasuコマンドホイール
zh_hans: Sasu 命令轮盘
zh_hant: Sasu 指令轉盤

source: Sasu Needs Screen Recording
ja: Sasuには画面収録が必要です
zh_hans: Sasu 需要屏幕录制权限
zh_hant: Sasu 需要螢幕錄製權限

source: Sasu Settings
ja: Sasu設定
zh_hans: Sasu 设置
zh_hant: Sasu 設定

source: Select or highlight text, then press the hotkey. With Accessibility access, Sasu reads the selection directly; otherwise it uses a screenshot.
ja: テキストを選択またはハイライトしてからホットキーを押します。アクセシビリティへのアクセスがあればSasuは選択範囲を直接読み取り、なければスクリーンショットを使用します。
zh_hans: 选择或高亮文本，然后按快捷键。获得辅助功能权限后，Sasu 会直接读取所选内容；否则会使用截屏。
zh_hant: 選取或反白文字，然後按快速鍵。取得輔助使用權限後，Sasu 會直接讀取所選內容；否則會使用截圖。

source: Something went wrong.
ja: 問題が発生しました。
zh_hans: 出现了问题。
zh_hant: 發生問題。

source: Space
ja: スペース
zh_hans: 空格
zh_hant: 空白鍵

source: Stop
ja: 停止
zh_hans: 停止
zh_hant: 停止

source: Suggested highlight: %@
ja: おすすめのハイライト：%@
zh_hans: 建议高亮：%@
zh_hant: 建議醒目標示：%@

source: Test Screen Capture
ja: 画面キャプチャをテスト
zh_hans: 测试屏幕捕捉
zh_hant: 測試螢幕擷取

source: Traditional Chinese
ja: 繁体字中国語
zh_hans: 繁体中文
zh_hant: 繁體中文

source: Transcript
ja: 会話記録
zh_hans: 对话记录
zh_hant: 對話記錄

source: Transcript cleared.
ja: 会話記録を消去しました。
zh_hans: 对话记录已清除。
zh_hant: 對話記錄已清除。

source: Transcript copied to clipboard.
ja: 会話記録をクリップボードにコピーしました。
zh_hans: 对话记录已复制到剪贴板。
zh_hant: 對話記錄已複製到剪貼簿。

source: Transcript text size
ja: 会話記録の文字サイズ
zh_hans: 对话记录文本大小
zh_hant: 對話記錄文字大小

source: Translate & Replace
ja: 翻訳して置換
zh_hans: 翻译并替换
zh_hant: 翻譯並取代

source: Translate Clipboard
ja: クリップボードを翻訳
zh_hans: 翻译剪贴板
zh_hant: 翻譯剪貼簿

source: Translate from
ja: 翻訳元
zh_hans: 源语言
zh_hant: 來源語言

source: Translate Selection
ja: 選択範囲を翻訳
zh_hans: 翻译所选内容
zh_hant: 翻譯所選內容

source: Translate Selected Text Faster?
ja: 選択したテキストをより速く翻訳しますか？
zh_hans: 更快地翻译所选文本？
zh_hant: 更快地翻譯所選文字？

source: Translation
ja: 翻訳
zh_hans: 翻译
zh_hant: 翻譯

source: Translation ready.
ja: 翻訳の準備ができました。
zh_hans: 翻译已就绪。
zh_hant: 翻譯已就緒。

source: Try Sasu on this example
ja: この例でSasuを試す
zh_hans: 通过此示例试用 Sasu
zh_hant: 透過此範例試用 Sasu

source: Use
ja: 使用するもの
zh_hans: 使用
zh_hant: 使用

source: Version %@
ja: バージョン %@
zh_hans: 版本 %@
zh_hant: 版本 %@

source: View
ja: 表示
zh_hans: 显示
zh_hant: 顯示方式

source: Waiting for the first screen capture...
ja: 最初の画面キャプチャを待っています...
zh_hans: 正在等待首次屏幕捕捉...
zh_hant: 正在等待首次螢幕擷取...

source: Working…
ja: 処理中…
zh_hans: 正在处理…
zh_hant: 正在處理…

source: You
ja: あなた
zh_hans: 你
zh_hant: 你

source: You can also use ⌘+ and ⌘−.
ja: ⌘+と⌘−も使用できます。
zh_hans: 也可以使用 ⌘+ 和 ⌘−。
zh_hant: 也可以使用 ⌘+ 和 ⌘−。

source: %lld characters from %@
ja: %2$@から%1$lld文字
zh_hans: 来自 %2$@ 的 %1$lld 个字符
zh_hant: 來自 %2$@ 的 %1$lld 個字元

source: Add your OpenAI API key in Sasu before capturing the screen.
ja: 画面をキャプチャする前に、SasuにOpenAI APIキーを追加してください。
zh_hans: 捕捉屏幕前，请在 Sasu 中添加 OpenAI API 密钥。
zh_hant: 擷取螢幕前，請在 Sasu 中加入 OpenAI API 金鑰。

source: Approve the macOS Accessibility prompt, or enable Sasu in System Settings, then relaunch Sasu.
ja: macOSのアクセシビリティ確認を承認するか、システム設定でSasuを有効にしてから、Sasuを再起動してください。
zh_hans: 请批准 macOS 辅助功能提示，或在“系统设置”中启用 Sasu，然后重新启动 Sasu。
zh_hant: 請核准 macOS 輔助使用提示，或在「系統設定」中啟用 Sasu，然後重新啟動 Sasu。

source: Approve the macOS Screen Recording prompt. If you do not see it, use Open Screen Recording Settings.
ja: macOSの画面収録確認を承認してください。表示されない場合は「画面収録設定を開く」を使用してください。
zh_hans: 请批准 macOS 屏幕录制提示。如果没有看到提示，请使用“打开屏幕录制设置”。
zh_hant: 請核准 macOS 螢幕錄製提示。如果沒有看到提示，請使用「開啟螢幕錄製設定」。

source: Capture & Ask hotkey reset to %@.
ja: 「キャプチャして質問」のホットキーを%@にリセットしました。
zh_hans: “捕捉并提问”快捷键已重置为 %@。
zh_hant: 「擷取並提問」快速鍵已重設為 %@。

source: Capture the screen before sending a follow-up.
ja: 追加の質問を送信する前に画面をキャプチャしてください。
zh_hans: 发送后续问题前，请先捕捉屏幕。
zh_hant: 傳送後續問題前，請先擷取螢幕。

source: Clipboard text:
ja: クリップボードのテキスト：
zh_hans: 剪贴板文本：
zh_hant: 剪貼簿文字：

source: Clipboard translation ready.
ja: クリップボードの翻訳が完了しました。
zh_hans: 剪贴板翻译已就绪。
zh_hant: 剪貼簿翻譯已就緒。

source: Command wheel hotkey reset to %@.
ja: コマンドホイールのホットキーを%@にリセットしました。
zh_hans: 命令轮盘快捷键已重置为 %@。
zh_hant: 指令轉盤快速鍵已重設為 %@。

source: Could not clear API key: %@
ja: APIキーを消去できませんでした：%@
zh_hans: 无法清除 API 密钥：%@
zh_hant: 無法清除 API 金鑰：%@

source: Could not clear Sasu backend access: %@
ja: Sasuバックエンドへのアクセスを消去できませんでした：%@
zh_hans: 无法清除 Sasu 后端访问权限：%@
zh_hant: 無法清除 Sasu 後端存取權：%@

source: Could not redeem invite.
ja: 招待コードを引き換えられませんでした。
zh_hans: 无法兑换邀请。
zh_hant: 無法兌換邀請。

source: Could not register %@: %@
ja: %@を登録できませんでした：%@
zh_hans: 无法注册 %@：%@
zh_hant: 無法註冊 %@：%@

source: Could not save API key: %@
ja: APIキーを保存できませんでした：%@
zh_hans: 无法存储 API 密钥：%@
zh_hant: 無法儲存 API 金鑰：%@

source: Enable Sasu in System Settings > Privacy & Security > Accessibility to translate selected text in other apps.
ja: ほかのアプリで選択したテキストを翻訳するには、「システム設定」>「プライバシーとセキュリティ」>「アクセシビリティ」でSasuを有効にしてください。
zh_hans: 要翻译其他 App 中的所选文本，请在“系统设置”>“隐私与安全性”>“辅助功能”中启用 Sasu。
zh_hant: 若要翻譯其他 App 中的所選文字，請在「系統設定」>「隱私權與安全性」>「輔助使用」中啟用 Sasu。

source: Enter a valid Sasu backend URL in Settings.
ja: 設定で有効なSasuバックエンドURLを入力してください。
zh_hans: 请在“设置”中输入有效的 Sasu 后端 URL。
zh_hant: 請在「設定」中輸入有效的 Sasu 後端 URL。

source: Explain this
ja: これを説明して
zh_hans: 解释此内容
zh_hant: 解釋此內容

source: Explain this page
ja: このページを説明して
zh_hans: 解释此页面
zh_hant: 解釋此頁面

source: Hotkey registration failed with status %lld.
ja: ホットキーの登録に失敗しました（ステータス：%lld）。
zh_hans: 快捷键注册失败，状态为 %lld。
zh_hant: 快速鍵註冊失敗，狀態為 %lld。

source: If you enabled Sasu in Accessibility settings, quit and reopen Sasu before Translate & Replace works.
ja: アクセシビリティ設定でSasuを有効にした場合は、「翻訳して置換」を使用する前にSasuを終了して再度開いてください。
zh_hans: 如果已在辅助功能设置中启用 Sasu，请退出并重新打开 Sasu，然后再使用“翻译并替换”。
zh_hant: 如果已在輔助使用設定中啟用 Sasu，請結束並重新開啟 Sasu，然後再使用「翻譯並取代」。

source: Invite accepted. Sasu is ready.
ja: 招待が承認されました。Sasuを使用できます。
zh_hans: 邀请已接受。Sasu 已就绪。
zh_hant: 邀請已接受。Sasu 已就緒。

source: Keychain returned status %lld.
ja: キーチェーンからステータス%lldが返されました。
zh_hans: 钥匙串返回了状态 %lld。
zh_hant: 鑰匙圈傳回狀態 %lld。

source: Model reset to %@.
ja: モデルを%@にリセットしました。
zh_hans: 模型已重置为 %@。
zh_hant: 模型已重設為 %@。

source: Next, enable Screen Recording so Sasu can see the page you ask about.
ja: 次に、質問するページをSasuが確認できるように画面収録を有効にします。
zh_hans: 接下来，请启用屏幕录制，以便 Sasu 查看您询问的页面。
zh_hant: 接下來，請啟用螢幕錄製，讓 Sasu 能查看您詢問的頁面。

source: No text was selected. Select text in the app you are editing, then choose Translate & Replace again.
ja: テキストが選択されていません。編集中のアプリでテキストを選択してから、もう一度「翻訳して置換」を選んでください。
zh_hans: 未选择文本。请在正在编辑的 App 中选择文本，然后再次选择“翻译并替换”。
zh_hant: 未選取文字。請在正在編輯的 App 中選取文字，然後再次選擇「翻譯並取代」。

source: Open your Sasu invite link or redeem an invite code in Settings before using invite access.
ja: 招待アクセスを使用する前に、Sasuの招待リンクを開くか、設定で招待コードを引き換えてください。
zh_hans: 使用邀请访问前，请打开 Sasu 邀请链接或在“设置”中兑换邀请码。
zh_hant: 使用邀請存取前，請開啟 Sasu 邀請連結或在「設定」中兌換邀請碼。

source: OpenAI API key cleared.
ja: OpenAI APIキーを消去しました。
zh_hans: OpenAI API 密钥已清除。
zh_hant: OpenAI API 金鑰已清除。

source: OpenAI API key saved in Keychain.
ja: OpenAI APIキーをキーチェーンに保存しました。
zh_hans: OpenAI API 密钥已存储在钥匙串中。
zh_hant: OpenAI API 金鑰已儲存在鑰匙圈中。

source: OpenAI request failed: %@
ja: OpenAIへのリクエストに失敗しました：%@
zh_hans: OpenAI 请求失败：%@
zh_hant: OpenAI 要求失敗：%@

source: OpenAI returned an invalid response.
ja: OpenAIから無効な応答が返されました。
zh_hans: OpenAI 返回了无效响应。
zh_hant: OpenAI 傳回了無效回應。

source: OpenAI returned no answer.
ja: OpenAIから回答が返されませんでした。
zh_hans: OpenAI 未返回回答。
zh_hant: OpenAI 未傳回答案。

source: Paste an invite code before redeeming.
ja: 引き換える前に招待コードを貼り付けてください。
zh_hans: 兑换前请粘贴邀请码。
zh_hant: 兌換前請貼上邀請碼。

source: Paste an OpenAI API key before saving.
ja: 保存する前にOpenAI APIキーを貼り付けてください。
zh_hans: 存储前请粘贴 OpenAI API 密钥。
zh_hant: 儲存前請貼上 OpenAI API 金鑰。

source: Reading clipboard...
ja: クリップボードを読み取り中...
zh_hans: 正在读取剪贴板...
zh_hant: 正在讀取剪貼簿...

source: Reading selected text...
ja: 選択したテキストを読み取り中...
zh_hans: 正在读取所选文本...
zh_hant: 正在讀取所選文字...

source: Reading selection…
ja: 選択範囲を読み取り中…
zh_hans: 正在读取所选内容…
zh_hant: 正在讀取所選內容…

source: Redeeming invite...
ja: 招待コードを引き換え中...
zh_hans: 正在兑换邀请...
zh_hant: 正在兌換邀請...

source: Safari page content was not included: %@
ja: Safariページの内容は含まれませんでした：%@
zh_hans: 未包含 Safari 页面内容：%@
zh_hant: 未包含 Safari 頁面內容：%@

source: Sasu backend access cleared.
ja: Sasuバックエンドへのアクセスを消去しました。
zh_hans: Sasu 后端访问权限已清除。
zh_hant: Sasu 後端存取權已清除。

source: Sasu Bug Report
ja: Sasuバグレポート
zh_hans: Sasu 错误报告
zh_hant: Sasu 錯誤報告

source: Sasu can point to the next place to click.
ja: Sasuは次にクリックする場所を示すことができます。
zh_hans: Sasu 可以指出下一步要点击的位置。
zh_hant: Sasu 可以指出下一步要點按的位置。

source: Sasu could not capture the main display.
ja: Sasuはメインディスプレイをキャプチャできませんでした。
zh_hans: Sasu 无法捕捉主显示器。
zh_hant: Sasu 無法擷取主要顯示器。

source: Sasu could not read this link.
ja: Sasuはこのリンクを読み取れませんでした。
zh_hans: Sasu 无法读取此链接。
zh_hant: Sasu 無法讀取此連結。

source: Sasu could not send the copy or paste command.
ja: Sasuはコピーまたはペーストのコマンドを送信できませんでした。
zh_hans: Sasu 无法发送复制或粘贴命令。
zh_hant: Sasu 無法傳送複製或貼上指令。

source: Screen Recording permission granted. Press %@ and choose Capture & Ask.
ja: 画面収録が許可されました。%@を押して「キャプチャして質問」を選択してください。
zh_hans: 已授予屏幕录制权限。按 %@ 并选择“捕捉并提问”。
zh_hant: 已授予螢幕錄製權限。按 %@ 並選擇「擷取並提問」。

source: Selected text:
ja: 選択したテキスト：
zh_hans: 所选文本：
zh_hant: 所選文字：

source: Selection translated.
ja: 選択範囲を翻訳しました。
zh_hans: 所选内容已翻译。
zh_hant: 所選內容已翻譯。

source: Selection translation failed.
ja: 選択範囲の翻訳に失敗しました。
zh_hans: 所选内容翻译失败。
zh_hant: 所選內容翻譯失敗。

source: Set up invite access or add your OpenAI API key, then use the Sasu command wheel.
ja: 招待アクセスを設定するかOpenAI APIキーを追加してから、Sasuコマンドホイールを使用してください。
zh_hans: 请设置邀请访问权限或添加 OpenAI API 密钥，然后使用 Sasu 命令轮盘。
zh_hant: 請設定邀請存取權或加入 OpenAI API 金鑰，然後使用 Sasu 指令轉盤。

source: Slash
ja: スラッシュ
zh_hans: 斜杠
zh_hant: 斜線

source: The clipboard does not contain text. Copy text first, then press Translate Clipboard.
ja: クリップボードにテキストがありません。先にテキストをコピーしてから「クリップボードを翻訳」を押してください。
zh_hans: 剪贴板中没有文本。请先复制文本，然后按“翻译剪贴板”。
zh_hant: 剪貼簿中沒有文字。請先複製文字，然後按「翻譯剪貼簿」。

source: The saved API key could not be read.
ja: 保存されたAPIキーを読み取れませんでした。
zh_hans: 无法读取已存储的 API 密钥。
zh_hant: 無法讀取已儲存的 API 金鑰。

source: The selected text is empty. Select text to translate, then choose Translate & Replace again.
ja: 選択したテキストが空です。翻訳するテキストを選択してから、もう一度「翻訳して置換」を選んでください。
zh_hans: 所选文本为空。请选择要翻译的文本，然后再次选择“翻译并替换”。
zh_hant: 所選文字是空的。請選取要翻譯的文字，然後再次選擇「翻譯並取代」。

source: Translate & Replace hotkey reset to %@.
ja: 「翻訳して置換」のホットキーを%@にリセットしました。
zh_hans: “翻译并替换”快捷键已重置为 %@。
zh_hant: 「翻譯並取代」快速鍵已重設為 %@。

source: Translate & Replace was cancelled.
ja: 「翻訳して置換」をキャンセルしました。
zh_hans: 已取消“翻译并替换”。
zh_hant: 已取消「翻譯並取代」。

source: Translate Selection hotkey reset to %@.
ja: 「選択範囲を翻訳」のホットキーを%@にリセットしました。
zh_hans: “翻译所选内容”快捷键已重置为 %@。
zh_hant: 「翻譯所選內容」快速鍵已重設為 %@。

source: Translating clipboard...
ja: クリップボードを翻訳中...
zh_hans: 正在翻译剪贴板...
zh_hant: 正在翻譯剪貼簿...

source: Translating selected text...
ja: 選択したテキストを翻訳中...
zh_hans: 正在翻译所选文本...
zh_hant: 正在翻譯所選文字...

source: Translating selection...
ja: 選択範囲を翻訳中...
zh_hans: 正在翻译所选内容...
zh_hant: 正在翻譯所選內容...

source: Translating selection…
ja: 選択範囲を翻訳中…
zh_hans: 正在翻译所选内容…
zh_hant: 正在翻譯所選內容…

source: Translating…
ja: 翻訳中…
zh_hans: 正在翻译…
zh_hant: 正在翻譯…

source: Translation failed.
ja: 翻訳に失敗しました。
zh_hans: 翻译失败。
zh_hant: 翻譯失敗。

source: Use Capture & Ask from the app while the hotkey is unavailable.
ja: ホットキーを使用できない間は、アプリから「キャプチャして質問」を使用してください。
zh_hans: 快捷键不可用时，请从 App 中使用“捕捉并提问”。
zh_hant: 快速鍵無法使用時，請從 App 中使用「擷取並提問」。

source: Use the Sasu menu while the command wheel hotkey is unavailable.
ja: コマンドホイールのホットキーを使用できない間は、Sasuメニューを使用してください。
zh_hans: 命令轮盘快捷键不可用时，请使用 Sasu 菜单。
zh_hant: 指令轉盤快速鍵無法使用時，請使用 Sasu 選單。

source: Use Translate & Replace from the app while the hotkey is unavailable.
ja: ホットキーを使用できない間は、アプリから「翻訳して置換」を使用してください。
zh_hans: 快捷键不可用时，请从 App 中使用“翻译并替换”。
zh_hant: 快速鍵無法使用時，請從 App 中使用「翻譯並取代」。

source: Use Translate Selection from the app while the hotkey is unavailable.
ja: ホットキーを使用できない間は、アプリから「選択範囲を翻訳」を使用してください。
zh_hans: 快捷键不可用时，请从 App 中使用“翻译所选内容”。
zh_hant: 快速鍵無法使用時，請從 App 中使用「翻譯所選內容」。

source: Waiting for Screen Recording permission...
ja: 画面収録の許可を待っています...
zh_hans: 正在等待屏幕录制权限...
zh_hant: 正在等待螢幕錄製權限...

source: Welcome to Sasu. Try the example before enabling Screen Recording.
ja: Sasuへようこそ。画面収録を有効にする前に例をお試しください。
zh_hans: 欢迎使用 Sasu。启用屏幕录制前，请先试用示例。
zh_hant: 歡迎使用 Sasu。啟用螢幕錄製前，請先試用範例。

source: What now?
ja: 次はどうすればいい？
zh_hans: 下一步呢？
zh_hant: 下一步呢？

source: Asking OpenAI...
ja: OpenAIに問い合わせ中...
zh_hans: 正在询问 OpenAI...
zh_hant: 正在詢問 OpenAI...

source: Hosted invite access has a monthly usage limit to keep the beta sustainable. Text-only translations use less of the limit than screenshot requests.
ja: ベータ版を継続して提供できるよう、ホスト型の招待アクセスには月間使用量の上限があります。テキストのみの翻訳は、スクリーンショットを使うリクエストより使用量が少なくなります。
zh_hans: 为确保测试版可持续运行，托管邀请访问设有每月用量限制。纯文本翻译比截屏请求消耗的用量更少。
zh_hant: 為確保測試版能持續運作，託管邀請存取設有每月用量限制。純文字翻譯比截圖要求使用更少的額度。

source: If you enabled Sasu in Accessibility settings, relaunch Sasu for Translate & Replace to work.
ja: アクセシビリティ設定でSasuを有効にした場合は、「翻訳して置換」を使用するためにSasuを再起動してください。
zh_hans: 如果已在辅助功能设置中启用 Sasu，请重新启动 Sasu，以便使用“翻译并替换”。
zh_hant: 如果已在輔助使用設定中啟用 Sasu，請重新啟動 Sasu，以便使用「翻譯並取代」。

source: Invite links should open Sasu automatically. If they do not, paste the invite code here.
ja: 招待リンクを開くとSasuが自動的に起動します。起動しない場合は、ここに招待コードを貼り付けてください。
zh_hans: 邀请链接应会自动打开 Sasu。如果没有，请在此处粘贴邀请码。
zh_hant: 邀請連結應會自動開啟 Sasu。如果沒有，請在此處貼上邀請碼。

source: Open System Settings > Privacy & Security > Accessibility, then enable Sasu.
ja: 「システム設定」>「プライバシーとセキュリティ」>「アクセシビリティ」を開き、Sasuを有効にしてください。
zh_hans: 请打开“系统设置”>“隐私与安全性”>“辅助功能”，然后启用 Sasu。
zh_hant: 請開啟「系統設定」>「隱私權與安全性」>「輔助使用」，然後啟用 Sasu。

source: Open System Settings > Privacy & Security > Automation, then enable Safari under Sasu.
ja: 「システム設定」>「プライバシーとセキュリティ」>「オートメーション」を開き、Sasuの下にあるSafariを有効にしてください。
zh_hans: 请打开“系统设置”>“隐私与安全性”>“自动化”，然后在 Sasu 下启用 Safari。
zh_hant: 請開啟「系統設定」>「隱私權與安全性」>「自動化」，然後在 Sasu 下啟用 Safari。

source: Open System Settings > Privacy & Security > Screen Recording, then enable Sasu.
ja: 「システム設定」>「プライバシーとセキュリティ」>「画面収録」を開き、Sasuを有効にしてください。
zh_hans: 请打开“系统设置”>“隐私与安全性”>“屏幕录制”，然后启用 Sasu。
zh_hant: 請開啟「系統設定」>「隱私權與安全性」>「螢幕錄製」，然後啟用 Sasu。

source: OpenAI request failed with HTTP status %lld.%@
ja: OpenAIへのリクエストがHTTPステータス%lldで失敗しました。%@
zh_hans: OpenAI 请求失败，HTTP 状态为 %lld。%@
zh_hant: OpenAI 要求失敗，HTTP 狀態為 %lld。%@

source: OpenAI returned HTTP 429. This is usually a rate limit, quota issue, or unsupported priority processing. Set Speed to auto and try again.%@
ja: OpenAIからHTTP 429が返されました。通常はレート制限、割り当ての問題、または未対応の優先処理が原因です。「速度」を「自動」に設定して、もう一度お試しください。%@
zh_hans: OpenAI 返回了 HTTP 429。这通常是速率限制、配额问题或不支持优先处理所致。请将“速度”设为“自动”，然后重试。%@
zh_hant: OpenAI 傳回了 HTTP 429。這通常是速率限制、配額問題或不支援優先處理所致。請將「速度」設為「自動」，然後再試一次。%@

source: OpenAI returned HTTP 429: %@ Set Speed to auto if it is currently priority.
ja: OpenAIからHTTP 429が返されました：%@ 現在「速度」が「優先」の場合は「自動」に設定してください。
zh_hans: OpenAI 返回了 HTTP 429：%@ 如果“速度”当前设为“优先”，请改为“自动”。
zh_hant: OpenAI 傳回了 HTTP 429：%@ 如果「速度」目前設為「優先」，請改為「自動」。
